; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-2-7-289)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p1-4 - location
	p5-1 - location
	p0-5 - location
	p4-0 - location
	p4-2 - location
	p6-0 - location
	p3-0 - location
	p3-5 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s2)
	(at driver3 s0)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s2)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at package1 s5)
	(at package2 s5)
	(at package3 s2)
	(at package4 s3)
	(at package5 s6)
	(at package6 s1)
	(at package7 s3)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 8)
	(= (time-to-walk p1-4 s1) 8)
	(= (time-to-walk s4 p1-4) 6)
	(= (time-to-walk p1-4 s4) 6)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 3)
	(= (time-to-walk p5-1 s5) 3)
	(= (time-to-walk s1 p5-1) 5)
	(= (time-to-walk p5-1 s1) 5)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(= (time-to-walk s0 p0-5) 8)
	(= (time-to-walk p0-5 s0) 8)
	(= (time-to-walk s5 p0-5) 1)
	(= (time-to-walk p0-5 s5) 1)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 4)
	(= (time-to-walk p4-0 s4) 4)
	(= (time-to-walk s0 p4-0) 10)
	(= (time-to-walk p4-0 s0) 10)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(= (time-to-walk s4 p4-2) 8)
	(= (time-to-walk p4-2 s4) 8)
	(= (time-to-walk s2 p4-2) 9)
	(= (time-to-walk p4-2 s2) 9)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(= (time-to-walk s6 p6-0) 2)
	(= (time-to-walk p6-0 s6) 2)
	(= (time-to-walk s0 p6-0) 3)
	(= (time-to-walk p6-0 s0) 3)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 7)
	(= (time-to-walk p3-0 s3) 7)
	(= (time-to-walk s0 p3-0) 7)
	(= (time-to-walk p3-0 s0) 7)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 6)
	(= (time-to-walk p3-5 s3) 6)
	(= (time-to-walk s5 p3-5) 9)
	(= (time-to-walk p3-5 s5) 9)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 4)
	(= (time-to-drive s3 s0) 4)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 7)
	(= (time-to-drive s4 s0) 7)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 2)
	(= (time-to-drive s0 s6) 2)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 4)
	(= (time-to-drive s3 s6) 4)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 7)
	(= (time-to-drive s5 s6) 7)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 5)
	(= (time-to-drive s2 s4) 5)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 3)
	(= (time-to-drive s5 s4) 3)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 3)
	(= (time-to-drive s6 s4) 3)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 9)
	(= (time-to-drive s0 s2) 9)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 4)
	(= (time-to-drive s5 s2) 4)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 2)
	(= (time-to-drive s6 s2) 2)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 4)
	(= (time-to-drive s1 s3) 4)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 2)
	(= (time-to-drive s4 s3) 2)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 6)
	(= (time-to-drive s0 s1) 6)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 10)
	(= (time-to-drive s5 s1) 10)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 7)
	(= (time-to-drive s6 s1) 7)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s4)
	(at driver2 s5)
	(at driver3 s0)
	(at truck1 s0)
	(at truck2 s6)
	(at package1 s4)
	(at package2 s5)
	(at package3 s0)
	(at package4 s2)
	(at package5 s2)
	(at package6 s1)
	(at package7 s6)
	))

(:metric minimize (+ (* 3 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (board-truck driver1 truck1 s3)
   deleted: (at driver1 s3) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 3 of 12
2. (board-truck driver2 truck2 s2)
   deleted: (at driver2 s2) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 3 of 12
3. (load-truck package3 truck2 s2)
   deleted: (at package3 s2)
   added: (in package3 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 3 of 12
4. (load-truck package4 truck1 s3)
   deleted: (at package4 s3)
   added: (in package4 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 3 of 12
5. (load-truck package7 truck1 s3)
   deleted: (at package7 s3)
   added: (in package7 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 3 of 12
6. (drive-truck truck1 s3 s6 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s6)
   changed: (fuel-used) from 0 to 52
   goals met: 3 of 12
7. (drive-truck truck2 s2 s6 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s6)
   changed: (fuel-used) from 52 to 74
   goals met: 4 of 12
8. (unload-truck package7 truck1 s6)
   deleted: (in package7 truck1)
   added: (at package7 s6)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 5 of 12
9. (load-truck package5 truck1 s6)
   deleted: (at package5 s6)
   added: (in package5 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 5 of 12
10. (drive-truck truck1 s6 s2 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   changed: (fuel-used) from 74 to 100
   goals met: 5 of 12
11. (unload-truck package4 truck1 s2)
   deleted: (in package4 truck1)
   added: (at package4 s2)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 6 of 12
12. (unload-truck package5 truck1 s2)
   deleted: (in package5 truck1)
   added: (at package5 s2)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 7 of 12
13. (drive-truck truck1 s2 s4 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (fuel-used) from 100 to 150
   goals met: 7 of 12
14. (disembark-truck driver1 truck1 s4)
   deleted: (driving driver1 truck1)
   added: (at driver1 s4) (empty truck1)
   goals met: 8 of 12
15. (drive-truck truck2 s6 s0 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   changed: (fuel-used) from 150 to 172
   goals met: 7 of 12
16. (unload-truck package3 truck2 s0)
   deleted: (in package3 truck2)
   added: (at package3 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 8 of 12
17. (disembark-truck driver2 truck2 s0)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 8 of 12
18. (walk driver2 s0 p0-5)
   deleted: (at driver2 s0)
   added: (at driver2 p0-5)
   goals met: 8 of 12
19. (walk driver2 p0-5 s5)
   deleted: (at driver2 p0-5)
   added: (at driver2 s5)
   goals met: 9 of 12
20. (board-truck driver3 truck2 s0)
   deleted: (at driver3 s0) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 8 of 12
21. (drive-truck truck2 s0 s4 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s4)
   changed: (fuel-used) from 172 to 242
   goals met: 8 of 12
22. (drive-truck truck2 s4 s5 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   changed: (fuel-used) from 242 to 272
   goals met: 8 of 12
23. (load-truck package1 truck2 s5)
   deleted: (at package1 s5)
   added: (in package1 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 8 of 12
24. (disembark-truck driver3 truck2 s5)
   deleted: (driving driver3 truck2)
   added: (at driver3 s5) (empty truck2)
   goals met: 8 of 12
25. (board-truck driver2 truck2 s5)
   deleted: (at driver2 s5) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 7 of 12
26. (drive-truck truck2 s5 s4 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   changed: (fuel-used) from 272 to 305
   goals met: 7 of 12
27. (unload-truck package1 truck2 s4)
   deleted: (in package1 truck2)
   added: (at package1 s4)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 8 of 12
28. (drive-truck truck2 s4 s5 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   changed: (fuel-used) from 305 to 335
   goals met: 8 of 12
29. (disembark-truck driver2 truck2 s5)
   deleted: (driving driver2 truck2)
   added: (at driver2 s5) (empty truck2)
   goals met: 9 of 12
30. (board-truck driver1 truck1 s4)
   deleted: (at driver1 s4) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 8 of 12
31. (board-truck driver3 truck2 s5)
   deleted: (at driver3 s5) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 8 of 12
32. (drive-truck truck1 s4 s5 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   changed: (fuel-used) from 335 to 365
   goals met: 8 of 12
33. (drive-truck truck1 s5 s1 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   changed: (fuel-used) from 365 to 465
   goals met: 8 of 12
34. (disembark-truck driver3 truck2 s5)
   deleted: (driving driver3 truck2)
   added: (at driver3 s5) (empty truck2)
   goals met: 8 of 12
35. (disembark-truck driver1 truck1 s1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s1) (empty truck1)
   goals met: 8 of 12
36. (walk driver1 s1 p1-4)
   deleted: (at driver1 s1)
   added: (at driver1 p1-4)
   goals met: 8 of 12
37. (walk driver1 p1-4 s4)
   deleted: (at driver1 p1-4)
   added: (at driver1 s4)
   goals met: 9 of 12
38. (walk driver3 s5 p5-1)
   deleted: (at driver3 s5)
   added: (at driver3 p5-1)
   goals met: 9 of 12
39. (walk driver3 p5-1 s1)
   deleted: (at driver3 p5-1)
   added: (at driver3 s1)
   goals met: 9 of 12
40. (board-truck driver2 truck2 s5)
   deleted: (at driver2 s5) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 8 of 12
41. (drive-truck truck2 s5 s1 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   changed: (fuel-used) from 465 to 565
   goals met: 8 of 12
42. (drive-truck truck2 s1 s0 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 565 to 625
   goals met: 8 of 12
43. (board-truck driver3 truck1 s1)
   deleted: (at driver3 s1) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 8 of 12
44. (drive-truck truck1 s1 s5 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   changed: (fuel-used) from 625 to 725
   goals met: 8 of 12
45. (drive-truck truck1 s5 s6 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   changed: (fuel-used) from 725 to 795
   goals met: 8 of 12
46. (disembark-truck driver3 truck1 s6)
   deleted: (driving driver3 truck1)
   added: (at driver3 s6) (empty truck1)
   goals met: 8 of 12
47. (drive-truck truck2 s0 s6 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   changed: (fuel-used) from 795 to 815
   goals met: 9 of 12
48. (walk driver3 s6 p6-0)
   deleted: (at driver3 s6)
   added: (at driver3 p6-0)
   goals met: 9 of 12
49. (walk driver3 p6-0 s0)
   deleted: (at driver3 p6-0)
   added: (at driver3 s0)
   goals met: 10 of 12
50. (disembark-truck driver2 truck2 s6)
   deleted: (driving driver2 truck2)
   added: (at driver2 s6) (empty truck2)
   goals met: 10 of 12
51. (board-truck driver2 truck1 s6)
   deleted: (at driver2 s6) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 10 of 12
52. (drive-truck truck1 s6 s0 driver2)
   deleted: (at truck1 s6)
   added: (at truck1 s0)
   changed: (fuel-used) from 815 to 835
   goals met: 11 of 12
53. (disembark-truck driver2 truck1 s0)
   deleted: (driving driver2 truck1)
   added: (at driver2 s0) (empty truck1)
   goals met: 11 of 12
54. (walk driver2 s0 p0-5)
   deleted: (at driver2 s0)
   added: (at driver2 p0-5)
   goals met: 11 of 12
55. (walk driver2 p0-5 s5)
   deleted: (at driver2 p0-5)
   added: (at driver2 s5)
   goals met: 12 of 12
